export const FESTIVAL = {
    lunar: {
        "1-1": "春节",
        "1-15": "元宵节",
        "2-2": "龙头节",
        "5-5": "端午节",
        "7-7": "七夕节",
        "7-15": "中元节",
        "8-15": "中秋节",
        "9-9": "重阳节",
        "10-1": "寒衣节",
        "10-15": "下元节",
        "12-8": "腊八节",
        "12-23": "祭灶节",
    },
    gregorian: {
        "1-1": "元旦",
        "2-14": "情人节",
        "3-8": "妇女节",
        "3-12": "植树节",
        "4-5": "清明节",
        "5-1": "劳动节",
        "5-4": "青年节",
        "6-1": "儿童节",
        "7-1": "建党节",
        "8-1": "建军节",
        "9-10": "教师节",
        "10-1": "国庆节",
        "12-24": "平安夜",
        "12-25": "圣诞节",
    },
}

export const WEEKS = ['日', '一', '二', '三', '四', '五', '六'];

export const RULES = {
    knowledgeTitle: [
        { required: true, message: '请输入记事标题', trigger: 'blur' },
    ],
    knowledgeContent: [
        { required: true, message: '请输入记事内容', trigger: 'blur' },
    ],
}